In [3]:
# DataFrame in Pandas

import pandas as pd

In [4]:
nba=pd.read_csv('nba.csv')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28,SG,22,5-Jun,185,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8,PF,29,10-Jun,231,NaN,5000000.0

In [5]:
nba.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
452,Trey Lyles,Utah Jazz,41,PF,20,10-Jun,234,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8,PG,26,3-Jun,203,Butler,2433333.0
454,Raul Neto,Utah Jazz,25,PG,24,1-Jun,179,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21,C,26,3-Jul,256,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24,C,26,Jul-00,231,Kansas,947276.0

In [6]:
nba.index

RangeIndex(start=0, stop=457, step=1)

In [7]:
nba.shape

(457, 9)

In [9]:
# give information of dataset
nba.info

<bound method DataFrame.info of               Name            Team  Number Position  Age  Height  Weight  \
0    Avery Bradley  Boston Celtics       0       PG   25   2-Jun     180
1      Jae Crowder  Boston Celtics      99       SF   25   6-Jun     235
2     John Holland  Boston Celtics      30       SG   27   5-Jun     205
3      R.J. Hunter  Boston Celtics      28       SG   22   5-Jun     185
4    Jonas Jerebko  Boston Celtics       8       PF   29  10-Jun     231
..             ...             ...     ...      ...  ...     ...     ...
452     Trey Lyles       Utah Jazz      41       PF   20  10-Jun     234
453   Shelvin Mack       Utah Jazz       8       PG   26   3-Jun     203
454      Raul Neto       Utah Jazz      25       PG   24   1-Jun     179
455   Tibor Pleiss       Utah Jazz      21        C   26   3-Jul     256
456    Jeff Withey       Utah Jazz      24        C   26  Jul-00     231

               College     Salary
0                Texas  7730337.0
1            Marquette  6796117.0
2    Boston University        NaN
3        Georgia State  1148640.0
4                  NaN  5000000.0
..                 ...        ...
452           Kentucky  2239800.0
453             Butler  2433333.0
454                NaN   900000.0
455                NaN  2900000.0
456             Kansas   947276.0

[457 rows x 9 columns]>

In [11]:
# give all dataframe information dtype,no of size , column name
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      457 non-null int64
Position    457 non-null object
Age         457 non-null int64
Height      457 non-null object
Weight      457 non-null int64
College     373 non-null object
Salary      446 non-null float64
dtypes: float64(1), int64(3), object(5)
memory usage: 23.3+ KB

In [16]:
# get all data type frequancy or no. of times dtype occur
nba.get_dtype_counts()

c:\users\ravi nikam\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: `get_dtype_counts` has been deprecated and will be removed in a future version. For DataFrames use `.dtypes.value_counts()
  """Entry point for launching an IPython kernel.

float64    1
int64      3
object     5
dtype: int64

In [20]:
# give all column name
nba.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [21]:
# give index with column
nba.axes

[RangeIndex(start=0, stop=457, step=1),
 Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
        'College', 'Salary'],
       dtype='object')]